Revit 2024 API
HandRailType.SupportTypeId Property
 The support type of the handrail.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ElementId SupportTypeId { get; set; }
Visual Basic
Public Property SupportTypeId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ SupportTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The supportTypeId is not a valid rail support or invalidElementId.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
HandRailType Class
Autodesk.Revit.DB.Architecture Namespace